{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoding_1_2/kernel", "shape": [784, 128], "dtype": "float32"}, {"name": "encoding_1_2/bias", "shape": [128], "dtype": "float32"}, {"name": "encoding_2_2/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "encoding_2_2/bias", "shape": [64], "dtype": "float32"}, {"name": "encoded_output_2/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "encoded_output_2/bias", "shape": [32], "dtype": "float32"}]}]}