{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoding_1_3/kernel", "shape": [784, 128], "dtype": "float32"}, {"name": "encoding_1_3/bias", "shape": [128], "dtype": "float32"}, {"name": "encoding_2_3/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "encoding_2_3/bias", "shape": [64], "dtype": "float32"}, {"name": "encoded_output_3/kernel", "shape": [64, 8], "dtype": "float32"}, {"name": "encoded_output_3/bias", "shape": [8], "dtype": "float32"}, {"name": "decoding_1_6/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "decoding_1_6/bias", "shape": [64], "dtype": "float32"}, {"name": "decoding_2_6/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "decoding_2_6/bias", "shape": [128], "dtype": "float32"}, {"name": "decoded_output_6/kernel", "shape": [128, 784], "dtype": "float32"}, {"name": "decoded_output_6/bias", "shape": [784], "dtype": "float32"}]}]}