{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "main_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "main_input"}, "inbound_nodes": []}, {"name": "encoding_1", "class_name": "Dense", "config": {"name": "encoding_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["main_input", 0, 0, {}]]]}, {"name": "encoding_2", "class_name": "Dense", "config": {"name": "encoding_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoding_1", 0, 0, {}]]]}, {"name": "encoded_output", "class_name": "Dense", "config": {"name": "encoded_output", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoding_2", 0, 0, {}]]]}, {"name": "decoding_1", "class_name": "Dense", "config": {"name": "decoding_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoded_output", 0, 0, {}]]]}, {"name": "decoding_2", "class_name": "Dense", "config": {"name": "decoding_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoding_1", 0, 0, {}]]]}, {"name": "decoded_output", "class_name": "Dense", "config": {"name": "decoded_output", "trainable": true, "dtype": "float32", "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoding_2", 0, 0, {}]]]}], "input_layers": [["main_input", 0, 0]], "output_layers": [["decoded_output", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adadelta", "config": {"learning_rate": 1.0, "rho": 0.95, "decay": 0.0, "epsilon": 1e-07}}, "loss": "binary_crossentropy", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "decoded_output/kernel", "shape": [128, 784], "dtype": "float32"}, {"name": "decoded_output/bias", "shape": [784], "dtype": "float32"}, {"name": "decoding_1/kernel", "shape": [32, 64], "dtype": "float32"}, {"name": "decoding_1/bias", "shape": [64], "dtype": "float32"}, {"name": "decoding_2/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "decoding_2/bias", "shape": [128], "dtype": "float32"}, {"name": "encoded_output/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "encoded_output/bias", "shape": [32], "dtype": "float32"}, {"name": "encoding_1/kernel", "shape": [784, 128], "dtype": "float32"}, {"name": "encoding_1/bias", "shape": [128], "dtype": "float32"}, {"name": "encoding_2/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "encoding_2/bias", "shape": [64], "dtype": "float32"}]}]}