{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "decoding_1_4/kernel", "shape": [32, 64], "dtype": "float32"}, {"name": "decoding_1_4/bias", "shape": [64], "dtype": "float32"}, {"name": "decoding_2_4/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "decoding_2_4/bias", "shape": [128], "dtype": "float32"}, {"name": "decoded_output_4/kernel", "shape": [128, 784], "dtype": "float32"}, {"name": "decoded_output_4/bias", "shape": [784], "dtype": "float32"}]}]}