{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoding_1_1/kernel", "shape": [784, 128], "dtype": "float32"}, {"name": "encoding_1_1/bias", "shape": [128], "dtype": "float32"}, {"name": "encoding_2_1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "encoding_2_1/bias", "shape": [64], "dtype": "float32"}, {"name": "encoded_output_1/kernel", "shape": [64, 16], "dtype": "float32"}, {"name": "encoded_output_1/bias", "shape": [16], "dtype": "float32"}, {"name": "decoding_1_2/kernel", "shape": [16, 64], "dtype": "float32"}, {"name": "decoding_1_2/bias", "shape": [64], "dtype": "float32"}, {"name": "decoding_2_2/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "decoding_2_2/bias", "shape": [128], "dtype": "float32"}, {"name": "decoded_output_2/kernel", "shape": [128, 784], "dtype": "float32"}, {"name": "decoded_output_2/bias", "shape": [784], "dtype": "float32"}]}]}